package com.example.javagotchi;

/**
 * Καθορίζει τους διαθέσιμους τύπους κατοικιδίων (pets) που μπορεί
 * να επιλέξει ένας χρήστης κατά την υιοθεσία.
 * Όπως και με τις ενέργειες, η χρήση Enum διασφαλίζει την ασφάλεια τύπων (type safety)
 * και αποτρέπει σφάλματα (π.χ. "dragon" αντί για "Dragon") κατά τη δημιουργία των αντικειμένων.
 */
public enum PetType {

    /** * Αντιπροσωπεύει ένα κανονικό κατοικίδιο (βάση της κλάσης Pet)
     * με τους προεπιλεγμένους ρυθμούς μείωσης στατιστικών.
     */
    NORMAL,

    /** * Αντιπροσωπεύει έναν Δράκο (DragonPet), ο οποίος χαρακτηρίζεται
     * από ταχύτερο ρυθμό αύξησης της πείνας του.
     */
    DRAGON,

    /** * Αντιπροσωπεύει ένα Slime (SlimePet), το οποίο έχει τη μοναδική ιδιότητα
     * να διατηρεί πάντα υψηλό το επίπεδο ευτυχίας του.
     */
    SLIME
}